Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/food_safety/food_safety_authority_of_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Food Safety Authority of Ireland
ga: An tÚdaras Éireannach um Shábhailteacht Bia

source: The Food Safety Authority of Ireland (FSAI) was established as a statutory body by the Food Safety Authority of Ireland Act, 1998
ga: Cuireadh An tÚdarás Éireannach um Shábháilteacht Bia (ÚÉSB) ar bun mar chomhlacht reachtúil faoin Acht Údarás Éireannach um Shábháilteacht Bia 1998

source: Its main function is to ensure that food produced, distributed or marketed in Ireland meets the highest standards of food safety and hygiene reasonably available and to ensure that food complies with legal requirements and recognised codes of good practice
ga: Is é a bpríomhfheidhm a chinntiú go gcomhlíonann bia a tháirgtear, a dháiltear nó a mhargaítear in Éirinn na caighdeáin is airde de shábháilteacht agus de shláintíocht bhia atá ar fáil go réasúnta agus lena chinntiú go gcomhlíonann bia na riachtanais dhlíthiúla agus na cóid aitheanta dea-chleachtais

source: Food legislation is enforced on behalf of the FSAI by a network of official agencies working under service contract to the FSAI
ga: Cuireann líonra de ghníomhaireachtaí oifigiúla reachtaíocht bhia i bhfeidhm thar ceann an ÚSBÉ a oibríonn faoi chonradh seirbhíse leis an ÚSBÉ

source: The main activities of the FSAI are:
ga: Is iad príomhghníomhaíochtaí an ÚÉSB ná:

source: • Co-ordinating food safety control programmes
ga: • Comhordú a dhéanamh ar chláracha smachtaithe sábháilteachta bia

source: • Inspecting, approving, licensing and registering premises involved in food production and distribution at manufacturing, wholesale and retail levels
ga: • Scrúdú, faomhú, ceadú agus clarú a dhéanamh ar áitribh a bhfuil baint acu le tairgeadh agus dáileadh bia ag léibhéil deantúis, mórdhíolta, agus miondíolta

source: • Auditing food safety activities in Ireland to ensure best practices are being observed
ga: • Iniúchadh a dhéanamh ar shábháilteacht bia in Éirinn chun a bheith cinnte go bhfuil na cleachtais is fearr in úsáid

source: • Linking up with the Health Protection Surveillance Centre, the Health Service Executive (HSE) and the Department of Agriculture, Food and the Marine to gather relevant data on human and animal infections
ga: • Nascadh a dhéanamh leis an Aonad Náisiúnta Faire ar Ghalair, Feidhmeannacht na Seirbhíse Sláinte agus an Roinn Talmhaíochta, Bia agus Mara chun eolas a bhailiú faoi ghalrú dhaoine agus ainmhithe

source: This is to identify the current public health priorities and emerging problems so that control measures can be targeted appropriately
ga: Déantar é seo chun tosaíocht sláinte phoiblí a aimsiú, chomh maith le fadhbanna, ionas go gcuirfear na smachta atá ag teastáil i bhfeidhm

source: • Providing education and advice for all, from primary producers to consumers, on how to prevent foodborne illness
ga: • Oideachas agus comhairle a chur ar fáil do chuile dhuine, ó thairgeoirí príomha go dtí tomhaltóirí, ar an mbealach is fearr chun tinneas bia-iompartha a sheachaint

source: • Linking with the Department of Health's Health Promotion Unit and existing bodies in the area, to provide advice on matters such as nutrition, food technology, industrial practices, the cultivation of food plants and animals, food labelling and packaging and on improving systems for the communication of information to the public on food safety and hygiene in the home
ga: • Nascadh a dhéanamh le hAonad Cur Chun Cinn Sláinte na Roinne Sláinte chun comhairle a thabhairt ar cheisteanna ar nós cothú, teicneolaíocht bia, cleachtais tionsclaíocha, saothrú plandaí bia agus ainmhithe, lipeadú bia agus pacaistíocht, agus na córais chun eolas a thabhairt don phobal faoi shábháilteacht bia agus sláinteachas sa bhaile a fheabhsú

source: The FSAI may exercise its authority directly or by service contracts with other agencies
ga: Féadfaidh an ÚSBÉ a n-údarás a fheidhmiú go díreach nó trí chonarthaí seirbhíse le gníomhaireachtaí eile

source: It has entered into service contracts with: the local authorities; the HSE; the Department of Agriculture, Food and the Marine; The Marine Institute; The National Standards Authority of Ireland; and The Sea Fisheries Protection Authority
ga: D’iontráil siad i gconarthaí seirbhíse leis an méid a leanas: na húdaráis áitiúla; FSS; an Roinn Talmhaíochta, Bia agus Mara; Foras na Mara; an tÚdarás um Chaighdeáin Náisiúnta na hÉireann; an tÚdarás um Chosaint Iascaigh Mhara

source: Each service contract includes the targets and objectives that the Authority wishes the agency to meet and the timeframe within which these must be achieved
ga: Leagann gach conradh seirbhíse síos na spriocanna agus na cuspóirí atá le comhlíonadh ag an eagraíocht, chomh maith leis an sprioc-ama atá i gceist

source: The Authority has published details of the contracts and has a system of monitoring to ensure the contracts are being adhered to
ga: Tá sonraí na gconarthaí foilsithe ag an údarás agus tá córas maoirseachta i bhfeidhm aige chun a bheith cinnte go bhfuiltear ag comhlíonadh na gconarthaí

source: The FSAI has a Memorandum of Understanding with Bord Iascaigh Mhara, Revenue’s Customs Service, and the Loughs Agency
ga: Tá Meabhrán Tuisceana ag an ÚSBÉ leis an Bord Iascaigh Mhara (BIM), Seirbhís Chustaim na gCoimisinéirí Ioncaim, agus Gníomhaireacht na Lochanna

source: Enforcement of food safety standards
ga: Cur i bhfeidhm caighdeáin sábháilteachta bia

source: The Authority has the power to carry out the following in order to determine compliance with food legislation:
ga: D'fhéadfadh an t-údarás na rudaí seo a leanas a dhéanamh chun a bheith cinnte go gcloítear le reachtaíocht bia

source: • The inspection, approval, licensing or registration of premises and equipment, including premises or equipment used in connection with the manufacture, processing, disposal, transport and storage of food
ga: • Áitribh agus fearas a scrúdú, a fhaomhú, a cheadú agus a chlarú, áitribh agus fearas a úsáidtear i dtaobh déantúis, próiseála, cur de láimh, iompair agus stóráil bia san áireamh

source: • The inspection, sampling, and analysis of food and food including food ingredients
ga: • Bia agus tairgí bia, ábhair bia san áireamh, a scrúdú, samplaí a thógáil agus anailís a dhéanamh orthu

source: • The inspection and analysis of food labelling
ga: • Lipéadú bia a scrúdú agus anailís a dhéanamh air

source: The FSAI carries out its enforcement role by means of service contracts with the official agencies
ga: Déanann an tÚdarás Éireannach um Shábháilteacht Bia an obair seo trí chonarthaí seirbhíse leis na heagrais oifigiúla

source: In order to maintain full traceability, the Authority's remit includes farms, other places of primary production, water treatment plants and any other source of materials used in food production
ga: Chun a bheith cinnte go bhfuil gach rud inaimsithe, tagann feirmeacha, áiteanna eile ina ndéantar táirgeadh príomha, ionaid choireála uisce agus foinse aon ábhar atá in úsáid chun bia a tháirgeadh, faoina chúram

source: The authority has a wide ranging power to seek reports from any State body on a matter that, in its opinion, impinges on food safety and to report to the Minister for Health
ga: Tá réimse leathan cumhachtaí ag an údarás tuairiscí a chuartú ó chomhlacht Stáit ar bith faoi cheist a bhfuil baint aici le sábháilteacht bia agus tuairisc a chur faoi bhráid an Aire Sláinte

source: The Authority has authorised officers who have extensive powers to enter and inspect food premises, to secure these premises for later inspection, to inspect and, if necessary, remove records
ga: Tá oifigigh cheadaithe ag an údarás le cumhachtaí leathana chun go mbeidh siad in ann dul isteach in áitribh bia agus iad a scrúdú, iad a chaomhnú le haghaidh scrúdaithe níos deireanaí, taifid a scrúdú agus más gá, iad a thógáil

source: These officers may take samples of food or related materials and have these samples analysed and it is an offence for any person to obstruct an officer in carrying out this duty
ga: D'fhéadfadh na hoifigigh seo samplaí bia nó ábhair a bhaineann leis a thógail, agus anailís a dhéanamh orthu agus is coir í d'aon duine cosc a chur ar oifigeach agus é/í i mbun an dualgais seo

source: The authorised officers are the staff of the various agencies involved in food safety, including Environmental Health Officers from the Health Service Executive (HSE)
ga: Is iad na hoifigigh cheadaithe ná foirne na n-eagras éagsúil a bhfuil baint acu le sábhailteacht bia, Oifigigh Sláinte Comhshaoil na Feidhmeannachta na Seirbhíse Sláinte (FSS) san áireamh

source: Where an authorised officer is of the view that any premises or activity poses a threat to public health, he/she has the power to set out the action required to remedy the situation and set a time limit for its completion
ga: Má cheapann oifigeach ceadaithe go bhfuil sláinte phoiblí i mbaol mar gheall ar áitreabh nó gníomhaíocht ar bith, tá an chumhacht aige/aice an obair atá ag teastáil chun an fhadhb a réiteach a leagan síos, agus sprioc-ama a chur leis an obair

source: The officer may serve an improvement notice, which is binding on the recipient
ga: Féadfaidh an t-oifigeach fógra feabhsúcháin a sheirbheáil, atá ina cheanglas ar an bhfaighteoir

source: Improvement notices are used where there is clear need for some remedial action but where a complete shut-down of operations may not be warranted
ga: Úsáidtear fógraí feabhais nuair atá sé soiléir go bhfuil obair fheabhais ag teastáil, ach nach mbeidh dúnadh iomlán riachtanach

source: Where an improvement notice is not complied with, the officer may seek an order from the District Court to force compliance – this is known as an improvement order
ga: Nuair nach gcomhlíontar fógra feabhais d'fhéadfadh an t-oifigeach ordú comhlíonta a chuartú ón gCúirt Chuarda - tugtar ordú feabhais ar seo

source: In more serious cases, where the officer believes there is an immediate and grave threat to public health, a closure order may be made
ga: I gcásanna níos tromchúisí, nuair a chreideann an t-oifigeach go bhfuil bagairt láithreach agus tromchúiseach do shláinte phoiblí, d'fhéadfadh sé/sí ordú dúnta a dhéanamh

source: This means that the operation must cease until the problem has been remedied
ga: Ciallaíonn sé seo go gcaithfear stop a chur leis an gnó go dtí go bhfuil an fhadhb réitithe

source: In cases where unsafe products or product batches have been distributed by the producer and are on the market, authorised officers may insist on the withdrawal, recall, detention and supervised destruction of products posing a threat to public health – they issue prohibition orders in these cases
ga: Má bhí tairgí nó baisc táirgí dáilithe ag an tairgeoir agus má tá siad ar an margadh, d'fhéadfadh oifigigh cheadaithe ordú a dhéanamh go dtarraineofaí siar, go gcoinneofaí agus go scriosfaí faoi mhaoirseacht na tairgí a bhfuil contúirt do shlainte phoiblí ag baint leo - eisíonn siad Orduithe Coisc sna cásanna seo

source: Breaches of the food safety laws may be prosecuted by the FSAI or any of the agencies involved
ga: D'fhéadfadh an tÚdarás Éireannach um Shábháilteacht Bia nó aon cheann de na heagrais duine nó eagraíocht a chuisiú má sháraítear dlíthe sábháilteachta bia

source: Promotion of food safety
ga: Sábhailteacht bia a chur chun cinn

source: The FSAI provides information and advice on a whole range of food safety issues, including foodborne diseases and risks and how to prevent food poisoning
ga: Cuireann an tÚdarás Éireannach um Shábháilteacht Bia eolas agus comhairle ar fáil i dtaobh réimse iomlán ceisteanna faoi shabháilteacht bia, galair bia-iompartha, contúirtí, agus cén chaoi is féidir nimhiú bia a sheachaint san áireamh

source: Information is available from the address below or from the FSAI website
ga: Tá eolas ar fail ón seoladh thíos nó ó shuíomh idirlín an Údaráis Éireannaigh um Shábhailteacht Bia

source: That site also has details of Alert Notifications and product recalls as well as Codes of Practice that have been agreed with various food producers
ga: Tá sonraí ar an suíomh idirlín maidir le Fógraí Aireacha tarraingt siar agus tairgí chomh maith le códanna cleachtais a aontaíonn tairgeoirí bia éagsúla leo

source: There are also guidance notes for retailers on the food safety laws and advice for consumers and the food industry
ga: Tá treoracha air chomh maith do mhiondíoltóirí ar dhlíthe a bhaineann le sábháilteacht bia agus comhairle do thomhaltóirí agus do thionscal an bhia

source: Food safety assurance schemes
ga: Scéimeanna cinnteachta sábháilteachta bia

source: The Authority may, either on its own initiative or in co-operation with food producers' representatives, establish schemes to protect consumer interests
ga: D'fhéadfadh an t-Údaras scéimeanna a bhunú chun leas tomhaltóirí a chosaint as a stuaim féin nó ag comhoibriú le hionadaithe tairgeoirí

source: These food safety assurance schemes cover the promotion of best practice and preparation of guidelines on raw materials, processing, packaging, preparation, storage and handling
ga: Clúdaíonn na "scéimeanna cinnteachta sábháilteachta bia" seo chur chun cinn an chleachtais is fearr agus réiteach treoirlínte faoi amhábhair, próiseáil, pacáistíocht, réiteach, stóráil agus láimhseáil
